[
    {
        "name":"The Gathering",
        "story":{
            "intro":"i0",
            "ending0":"e0",
            "ending1":"e1",
            "ending2":"e2",
            "ending3":"e3"
        },
        "locations":["1111"],
        "start_location":"1111",
        "agenda":[
            {
                "name":"What`s Going On?!",
                "doom":3,
                "desc":"It is late at night. You are holed up in your study, researching the bloody disappearances that have been taking place in the region. A few hours into your research, you hear the sound of strange chanting coming from your parlor, down the hall. At the same time, you hear dirt churning, as if something were digging beneath the floor.",
                "nameB":"A Lapse in Time",
                "descB":"Your house continues to change before your very eyes. The walls have decayed, and the ground in many rooms has turned to dirt. It is almost as if you have been transported somewhere else entirely, although every now and again you recognize elements of your former home."
            },            
            {
                "name":"Rise of the Ghouls",
                "doom":7,
                "desc":"The floor beneath you is giving way, and you see a vast network of tunnels, twisting into the darkness below. Shapes and silhouettes of strange creatures move swiftly through the tunnels, trying to find a way up. You probably don't want to be here when they do...",
                "nameB":"The Tunnels Below",
                "descB":"A feral beast, roughly humanoid with a canine cast and hooves for feet, tears through the ground in front of you. Below the floor, you can see vast tunnels beneath your house. Fiendish howling echoes from deep within the underground caverns."
            },            
            {
                "name":"They're Getting Out!",
                "doom":10,
                "desc":"You hear a crazed howl outside, and suddenly all the creatures turn their attention to that sound. They rush to escape the house, breaking down doors and clawing at everything in their way.",
                "nameB":"The Ghouls Break Free",
                "descB":"The ground begins to shake and you can see claws rising up from the dirt as uncanny creatures desperately try to claw their way out of the ground all around you. Everywhere you turn, you see monsters rising from the earth. Terrified, you flee as fast as you can."
            }
        ],
        "act":[
            {
                "name":"Trapped",
                "clues":2,
                "desc":"As you leap to investigate, the door to your study vanishes before your eyes, leaving behind only solid wall. You're trapped inside your study until you can find another way out.",
                "nameB":"The Door on the Floor",
                "descB":"You notice that the edges of your newly purchased rug are tattered and mud-stained. Finding this odd, you shift the furniture aside and pull back the rug. To your surprise, you see the door leading out of your study. You slowly turn the knob, and the door swings open, revealing your hallway below.\n\tYou jump through the doorway, landing on your feet on soft dirt. The door to the study slams shut above you. The smell of burning wood fills the narrow hall, intermingled with the scent of rot and decay.",
                "locations":["1112","1113","1114"]
            },            
            {
                "name":"The Barrier",
                "clues":3,
                "desc":"A glowing barrier blocks the path to your parlor. As you move toward it, intense heat forces you to back away. Picking up a handful of dirt, you toss it as the barrier and watch in horror as the dirt incinerates. Perhaps there's something in the cellar or attic that can help.",
                "nameB":"Breaking the Barrier",
                "descB":"Using the barrel from the attic, you carry ice and snow from the cellar and hurl it at the barrier. The barrier sparks and shudders as it consumes the ice, then hisses and fades out of existence.\n\tThe barrier blocking passage into the parlor has vanished. Reveal the Parlor."
            },
            {
                "name":"What Have You Done?",
                "clues":"-",
                "desc":"As you leap to investigate, the door to your study vanishes before your eyes, leaving behind only solid wall. You're trapped inside your study until you can find another way out.",
                "nameB":"Defending the Home",
                "descB":"When the robed creature falls, the fiendish swarm burrows back into the ground and the chaos of the house quiets. But the stranger in your parlor chamber doesn't seem relieved.\n\t\"You broke my seal that was set to trap the ghouls within.\" She raises her torch. \"Now, we must take more direct measures and burn this hell-pit to the ground!\""
            }
        ],
        "encounters":[],
        "Locations":[]
    }
]